[
    {
        "type": "message",
        "user": "U0N1FDZK2",
        "text": "One quick question to hyperledger community can the chain code talk amonst other chain code within existing blockchain … Like in Solc one contract can interface with other smart contract if yes then how …",
        "ts": "1471080760.000247"
    },
    {
        "type": "message",
        "user": "U0N1FDZK2",
        "text": "I am failing to find a good example for it",
        "ts": "1471080774.000248"
    },
    {
        "type": "message",
        "user": "U0ULK2JPP",
        "text": "<@U0N1FDZK2> chaincode can talk to another. fabric\/examples\/chaincode\/go\/chaincode_example04 and fabric\/examples\/chaincode\/go\/chaincode_example05 are the examples.",
        "ts": "1471094750.000249",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0N1FDZK2"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "<@U0N1FDZK2> and <@U0ULK2JPP>: would you not create a significant attack surface without a trustless protocol to exchange data\/services\/coins across chains? \n\nI mean, the two chains may speak the same language, but a node on one chain would not be able to prove to itself facts about the other chain.\n\nThe security level required would, of course, depend a lot on the nature of the service.",
        "edited": {
            "user": "U20NAT0SF",
            "ts": "1471103134.000000"
        },
        "ts": "1471102989.000250"
    },
    {
        "type": "message",
        "user": "U0N1FDZK2",
        "text": "No the point is to lets say there are multiple chaincode running in one chain and interface these multiple chain codes …",
        "ts": "1471106199.000252"
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "Oh ok. So _if_ it were an inter-chain scenario it would be problematic.",
        "ts": "1471106270.000253"
    },
    {
        "type": "message",
        "user": "U0ULK2JPP",
        "text": "<@U20NAT0SF>: its still the same “chain” (ledger)…. and yes, problematic if interchain",
        "ts": "1471106362.000254"
    },
    {
        "type": "message",
        "user": "U0N1FDZK2",
        "text": "Yes agree inter chain scenario would be problematic…",
        "ts": "1471106508.000255"
    },
    {
        "type": "message",
        "user": "U0N1FDZK2",
        "text": "as it would require dealing with 2 or more chains with different states at diffrent time",
        "ts": "1471106550.000256"
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "So... what does this multi-chaincode-per-blockchain scenario imply for scalability, volume, and bloat?",
        "ts": "1471106832.000257"
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "That is, I'm interested in whether multi-chain scenarios are something that would need to be designed for.",
        "ts": "1471107018.000258"
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "If this is the wrong place to have these sorts of high-level discussions, let me know.",
        "ts": "1471115621.000259"
    },
    {
        "type": "message",
        "user": "U20NAT0SF",
        "text": "Full disclosure: my interest in cross-chain interoperability is because I'm part of a project that's delivering solutions to exactly this problem.",
        "ts": "1471115670.000260"
    }
]