[
    {
        "type": "message",
        "user": "U0P1VU0QG",
        "text": "the confidential won't make any difference here, but the userCert should (user.cert)",
        "ts": "1479202115.002357"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "<@U0Y55KNG2> -  you are going to need to vendor your \"extra\" package",
        "ts": "1479215459.002360"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "(I'll assume you are using the SDK to deploy)",
        "ts": "1479215482.002361"
    },
    {
        "user": "U30DZDHDW",
        "text": "<@U30DZDHDW|kroisin> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1479222951.002362"
    },
    {
        "type": "message",
        "user": "U0Y55KNG2",
        "text": "Thanks Gary, I figured it out yesterday with Greg's help. I debug using REST, which is by far the handiest way to do it, although if need be I can add it to our Monitoring UI. It's stuck in REST land too, though (for now.) I used govendor to vendor all dependencies and it worked great with fast build times on Bluemix.",
        "ts": "1479223844.002363"
    },
    {
        "user": "U2Y2V95D2",
        "text": "<@U2Y2V95D2|alanlee> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1479225694.002364"
    },
    {
        "type": "message",
        "user": "U2Y2V95D2",
        "text": "Hi, I have a question.  Question: I want to save a variable X=\"This is a boy\" into the blockchain. And I want to encrypt it with my public key. But I cannot access my public key in the local file. Is there a way to do this please? Thank you.",
        "ts": "1479225808.002365"
    },
    {
        "user": "U31M2620Z",
        "text": "<@U31M2620Z|fan.torchz> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1479252206.002370"
    },
    {
        "type": "message",
        "user": "U22RH7VGT",
        "text": "<@U0ULK2JPP>  is there any documentation on how the table feature of chaincode works internally in fabric",
        "ts": "1479272287.002375"
    },
    {
        "type": "message",
        "user": "U2X9KDDL7",
        "text": "Hi all, is there a particular owner (or owners) of the shim code (or MockStub in particular)? I've submitted changes on Gerrit for review which fix the GetRows implementation in MockStub, and I apparently need to add a reviewer (I'm totally new to Gerrit and this is my first submission to the hyperledger repo)",
        "ts": "1479276683.002378"
    }
]