[
    {
        "type": "message",
        "user": "U0W7D64LC",
        "text": "<@U0ULQ2G5V>, I also have some suggestions. We should break out the use cases out of the requirements wiki, bringing them to a higher level. I would think this is a better spot : <https:\/\/github.com\/hyperledger\/hyperledger\/wiki> …. they are too buried. I’ve been asked several times where to find the use cases…",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "hyperledger\/hyperledger",
                "title_link": "https:\/\/github.com\/hyperledger\/hyperledger\/wiki",
                "text": "Hyperledger Project is a new Collaborative Project at The Linux Foundation. The technical community is just getting started and will be adding code to the repository in the coming weeks. Check hype...",
                "fallback": "GitHub: hyperledger\/hyperledger",
                "thumb_url": "https:\/\/avatars3.githubusercontent.com\/u\/7657900?v=3&s=400",
                "from_url": "https:\/\/github.com\/hyperledger\/hyperledger\/wiki",
                "thumb_width": 142,
                "thumb_height": 142,
                "id": 1
            }
        ],
        "ts": "1463106064.000174"
    },
    {
        "type": "message",
        "user": "U0W7D64LC",
        "text": "<@U0ULQ2G5V>: I would also suggest that we start to create more mailing lists on mailman provided by the foundation at <http:\/\/lists.hyperledger.org\/mailman\/listinfo> to allow folks to self subscribe to areas they are subject matter experts so that when we look at say a consensus requirement, we can send a notification to that list of folks to drive more participation and interaction from the world experts.",
        "ts": "1463106082.000176"
    },
    {
        "type": "message",
        "user": "U0W7D64LC",
        "text": "<@U0ULQ2G5V>: last, I think we need to concentrate on requirements against the current proposals in the incubator. Right now I think we’re neglecting the proposals, which may result in difficulty in getting out of incubator state. I think it might be good, easier to filter, to put the requirements in the backlog of issues as well, and label them as ‘new requirement’ or ‘under review’ or something so we can easily sort through them vs just listing on the wiki",
        "ts": "1463106423.000177"
    },
    {
        "type": "message",
        "user": "U0W7D64LC",
        "text": "just my 2 cents….",
        "ts": "1463106438.000178"
    }
]