[
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "so, never really documented the call we had 4\/21 following the TSC call…",
        "ts": "1461799303.000017"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "It is pretty clear that we should transition to using Gerritt to manage reviews and Jenkins for CI",
        "ts": "1461799330.000018"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "this has broader implications as transitioning to Gerritt in particular will mean the following:",
        "ts": "1461799363.000019"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "1. we’ll lose commit history because the approach that LF requires is that we squash all past commits and make a single PR with a DCO signoff so that we can manage the DCO with certainty",
        "ts": "1461799432.000020"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "1a. LF has Gerrit check bot for the DCO (probably way better than mine)",
        "edited": {
            "user": "U0KM61BCP",
            "ts": "1461799480.000000"
        },
        "ts": "1461799461.000021"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "2. by adopting Gerritt we will have to turn all commits to Github repos to Gerritt, meaning that only Gerritt has write access. this implies that we will need to adopt a bug tracking alternative to Github. LF can support both Jira and Bugzilla… the consensus on the call was Jira seemed to be preferred option",
        "ts": "1461799604.000023"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "2a. there’s an automated migration from github to Jira issues, so that won’t be too much trouble",
        "ts": "1461799643.000024"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "3. LF made strong recommendation for Jenkins for CI.",
        "ts": "1461799682.000025"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "3a. they offer 24x7 support and manage themselves, whereas TravisCI is free and no support to speak of… who ya gonna call?",
        "ts": "1461799721.000026"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "3b. Sawtooth Lake already uses jenkins for CI so someone needs to adapt… better than supporting two modes",
        "ts": "1461799755.000027"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "3c. we really want (well, I do) a consistent set of tooling for Hyperledger projects",
        "ts": "1461799782.000028"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "3d. I think Jenkins is the right answer, so we will need to investigate migrating the TravisCI to Jenkins… This might be a good experiment for the hackathon",
        "ts": "1461799827.000029"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "4. we really should have formal RI function - LF can provide a resource, and we can have community members collaborating as well - I tend to agree as it seems that we’ll need to coordinate multiple repositories as we start breaking the project down to composable parts (despite my desire for a single repo build model)",
        "ts": "1461799930.000030"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "so, thanks again to the LF team for their deep insights",
        "ts": "1461799993.000031"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<!channel>: ^^",
        "ts": "1461800013.000032"
    },
    {
        "type": "message",
        "user": "U0NCW1DPX",
        "text": "<@U0KM61BCP>: thanks for your update",
        "ts": "1461805637.000033"
    }
]