[
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "chaitanya [8:29 AM] Is any user other than the admin allowed to make transactions, if they're pre-registered, meaning their credentials written in the membersrvc.yaml?\n\njonathanlevi [8:43 AM]  BTW: just quickly. The fact that a “user” has a OTP (one time password) entry in the memberservc.yaml… does not (yet) grant him\/her the permission to deploy\/execute a transaction...\n\nThe entry in the that yaml file, allows the user to register and enroll to the “system”, in a process resulting with an ECert (Enrollment Cert) a TCert (Transaction Cert) that are required in order to transact.\n\nThat part of the question is also good for the “cop” channel. I will post it there too in case you need more\/relevant details about that part of the flow.",
        "edited": {
            "user": "U11MANG9G",
            "ts": "1482241690.000000"
        },
        "ts": "1482241640.000131"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "<@U2JLNV77T> ^^^",
        "ts": "1482241647.000132"
    },
    {
        "user": "U2JLNV77T",
        "inviter": "U11MANG9G",
        "text": "<@U2JLNV77T|chaitanya> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1482241651.000133"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U2JLNV77T> I assume you're asking about membersrvc in v0.6 and not COP in v1?  The answers are similar but not identical and want to make sure I'm answering the right question first.",
        "ts": "1482243524.000135"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "I think the question is about v0.6 indeed.",
        "ts": "1482245599.000136"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "I have “deprecated” the membership-services channel… so that we can help people ask\/discuss\/learn about the existing vs. upcoming versions in the same channel.",
        "ts": "1482245648.000137"
    },
    {
        "type": "message",
        "user": "U2JLNV77T",
        "text": "<@U0S5KF44D> Yes, I was asking about membersrvc in v0.6",
        "ts": "1482251244.000138"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U2JLNV77T> So as Jonathan said, an entry in membersrvc.yaml registers the user, but you must still enroll prior to transacting",
        "ts": "1482251767.000139"
    },
    {
        "type": "message",
        "user": "U0YJUECE8",
        "text": "<@U2JLNV77T> to add to what keithsmith said,  a while back somebody here said \"Conceptually, registration is like creating an invitation to a party and enrollment is accepting the invitation\" .  They said this in reference to v0.5 but I suspect it applies to v0.6 as well.  (Not sure if this analogy also makes sense for v1.0, maybe somebody else knows)",
        "ts": "1482252136.000140"
    },
    {
        "type": "message",
        "user": "U2JLNV77T",
        "text": "<@U0YJUECE8> Yes, I think it applies to v0.6 for sure; I remember reading it on one of the channels too. :slightly_smiling_face:",
        "ts": "1482252364.000141"
    },
    {
        "user": "U1GRJD9NC",
        "text": "<@U1GRJD9NC|yuki.k> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1482253486.000142"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U2JLNV77T> <@U0YJUECE8> Yes, it definitely applies to all releases, including v1.0.    The differences for v1.0 wrt registration &amp; enrollment are as follows, otherwise is the same:",
        "ts": "1482255645.000143"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "1) v1.0 supports LDAP which means you don't pre-register users in the config file, rather they are the users that are in LDAP",
        "ts": "1482255715.000144",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0YJUECE8"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "so when you enroll, the COP server authenticates you against an LDAP server prior to allowing you to enroll",
        "ts": "1482255750.000145"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "2) COP in v1 supports a configurable number of password uses, instead of it always being a OTP.  For example, if you know you have a cluster of 3 servers which all need an ecert, then you can pre-register an entry with 3 uses of a password so each of them can enroll",
        "ts": "1482255907.000146"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "3) COP also supports renewing an ecert.  If you know your ecert will expire, you can renew before it expires.  The renewal doesn't require a user\/pass; instead, it uses the private key of the existing ecert to authenticate.",
        "ts": "1482256000.000147"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<!channel> any reason why fabric-cop is building with go 1.6 as opposed to go 1.7.x (which is where we are with fabric presently)",
        "ts": "1482265894.000148"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "No ... I'll ask Ramesh to change it",
        "ts": "1482267081.000149"
    }
]