[
    {
        "type": "message",
        "user": "U1CS08EP3",
        "text": "<@U0PB67X4K> and <@U11MANG9G> , that point about the revocation was interesting. \n<https:\/\/hyperledgerproject.slack.com\/archives\/fabric-cop\/p1482917026000235>\nThis do mean that fabric cop could provide API for revocation of a transaction certificate, which can indicate that that session is not valid anymore. \nSo how can a user get a next set of valid transaction certificates? Fabric-cop has an API for that? \n<@U11MANG9G> if these APIs are available, and if these approaches are viable ( from practical and performance point of views), this could end the topic of soft logout in a motivating note. ",
        "attachments": [
            {
                "from_url": "https:\/\/hyperledgerproject.slack.com\/archives\/fabric-cop\/p1482917026000235",
                "fallback": "[December 28th, 2016 1:23 AM] garisingh: Bottom line:   there is not a real concept of a session-based login for Fabric.  You obtain cryptographic enrollment material and use it to sign transactions.  The Fabric will \"accept\" transactions signed by this material as long as the Fabric \"trusts\" the issuer of the material and in the future as long as the material has not been revoked (similar to what <@U11MANG9G> is describing above)",
                "ts": "1482917026.000235",
                "author_subname": "garisingh",
                "channel_id": "C2Y3CPP16",
                "channel_name": "fabric-cop",
                "is_msg_unfurl": true,
                "text": "Bottom line:   there is not a real concept of a session-based login for Fabric.  You obtain cryptographic enrollment material and use it to sign transactions.  The Fabric will \"accept\" transactions signed by this material as long as the Fabric \"trusts\" the issuer of the material and in the future as long as the material has not been revoked (similar to what <@U11MANG9G> is describing above)",
                "author_link": "https:\/\/hyperledgerproject.slack.com\/team\/garisingh",
                "author_icon": "https:\/\/avatars.slack-edge.com\/2016-09-10\/78323915894_521dc680194c08b166e0_48.jpg",
                "mrkdwn_in": [
                    "text"
                ],
                "id": 1,
                "footer": "Posted in #fabric-cop"
            }
        ],
        "ts": "1483416872.000246"
    },
    {
        "type": "message",
        "user": "U1CS08EP3",
        "text": "<@U0PB67X4K> , these next set of certificate being passed along with the future transactions, would it impact the transaction auditing feature? ",
        "ts": "1483416965.000248"
    }
]