[
    {
        "type": "message",
        "user": "U0UHG4VP1",
        "text": "if you have commit rights, there is no requirement that you do reviews on github (github doesn’t enforce it). you wouldn’t need an internal repo to do that.",
        "ts": "1471419735.000072"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "<@U0UHG4VP1>: so, you mean the commits were merged into repositories directly by whom has the write access to repositories.",
        "ts": "1471420500.000073"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "Thanks, I got it.",
        "ts": "1471420508.000074"
    },
    {
        "type": "message",
        "user": "U0UHG4VP1",
        "text": "Yes. They pushed to master directly.",
        "ts": "1471420626.000075"
    },
    {
        "type": "message",
        "user": "U0UHG4VP1",
        "text": "Well, they might have an internal code review system that is mirrored out to github.",
        "ts": "1471420663.000076"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "Is there any plan  for all changes must be code reviewed, even for maintainers? When and which stage?",
        "ts": "1471421052.000077"
    },
    {
        "type": "message",
        "user": "U0UHG4VP1",
        "text": "That I do not know. For projects hosted on Gerrit, you cannot escape public code review. I know Intel was discussing moving over to Gerrit.",
        "ts": "1471421353.000078"
    },
    {
        "type": "message",
        "user": "U0UHG4VP1",
        "text": "Right now fabric and fabric-API are on Gerrit",
        "ts": "1471421434.000079"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "OK",
        "ts": "1471421913.000080"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "<@U0YQQRNU8>: Moving all client-side validation to be server-side,  that means the server has  the validation ability, and has the HTTP interface of validation.",
        "ts": "1471429026.000081"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "So client connects to the HTTP validation interface to validate transactions firstly,  if pass , then submitting the transactions. Do I get the point?",
        "ts": "1471429244.000082"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "I'd like to work on this \"refactoring\" that move all client-side validation to server-side.",
        "ts": "1471429348.000083"
    },
    {
        "type": "message",
        "user": "U0YQQRNU8",
        "text": "<@U1ZUSJHAA>: yes, that's the idea.  the complex piece is that mktclient has \"session\" in that it tests against all previous transactions it has generated.  the server-side does have validation-upon-submission today, but only of the transaction being submitted against the current state (which does not include any pending transactions).  so one idea would be to add the ability to start a session with the validator that has it's own state, etc. just for this pre-validation purpose.",
        "ts": "1471441280.000084"
    },
    {
        "type": "message",
        "user": "U0YQQRNU8",
        "text": "so if you have transactions A, B, C  ... C needs to be validated with A, B applied first",
        "ts": "1471441375.000085"
    },
    {
        "type": "message",
        "user": "U0YQQRNU8",
        "text": "<@U1ZUSJHAA>: to answer you question above about PRs, we do reviewed PRs for all commits. however, for the moment, some of the PRs are on a non-public github instance and then get pushed external.  the merge commits in the log show that activity.  we are working to fully externalized in a few weeks.  putting some polishing touches on an external jenkins instance to do PR builds currently (good progress in the last couple days on that front, in combination with the repo merge activity)",
        "ts": "1471446187.000086"
    }
]