[
    {
        "type": "message",
        "user": "U0KMHDKK3",
        "text": "Hi everybody - fyi: I wrote up some thoughts on Digital Asset's GSL paper from last year here:  <https:\/\/gendal.me\/2017\/01\/24\/towards-deeper-collaboration-in-distributed-ledgers-thoughts-on-digital-assets-global-synchronisation-log\/>",
        "attachments": [
            {
                "service_name": "Richard Gendal Brown",
                "service_url": "http:\/\/gendal.me",
                "title": "Towards Deeper Collaboration in Distributed Ledgers: Thoughts on Digital Asset’s Global Synchronisation Log",
                "title_link": "https:\/\/gendal.me\/2017\/01\/24\/towards-deeper-collaboration-in-distributed-ledgers-thoughts-on-digital-assets-global-synchronisation-log\/",
                "author_name": "gendal",
                "author_link": "https:\/\/gendal.me\/author\/gendal\/",
                "text": "It&rsquo;s now almost two months since we open-sourced Corda and I&rsquo;m delighted by the reception it has received. In our rapidly growing community, we&rsquo;re already seeing new users grow into leaders who help other newcomers get to grips with the platform.\nAnd I am amazed&nbsp;by the number of inbound messages from users who have been impressed&nbsp;by the quality of Corda&rsquo;s design and codebase &ndash; and who are already building significant applications and products on top of it. Indeed, as I write this, one of our member banks is running a global hackathon, with over 150 of their developers building on Corda and I&rsquo;ve just returned from our Asia Members&rsquo; Conference in Hong Kong, where&nbsp;I sat through so many presentations about Corda projects I didn&rsquo;t even know were happening&hellip;\nIf you&rsquo;re not already on our Slack or participating in our discussion forum, you&rsquo;re missing out!\nBut one additional benefit from delivering on our commitment to make Corda Open Source is that it means we can explore opportunities to collaborate with peers, competitors and partners across the ecosystem: identifying areas where our visions are aligned, where we see things the same way and where we might be able to reuse rather than needlessly reinvent.\nA good example of the potential for firms who some might see as competitors (but who actually aren&rsquo;t&hellip;) to collaborate was provided late last year in the form of an excellent whitepaper from Digital Asset: The Global Synchronization Log. &nbsp;The paper helps&nbsp;clarify some really important aspects of distributed ledger design and shows a really deep understanding of the tradeoffs that are inherent in the design of these platforms.\nThe first time I read the paper, I was struck by how closely our two firms&rsquo; visions for DLT are aligned. As Mike Hearn has written, there are two fundamentally different ways to design a DLT &ndash;&ldquo;UTXO&rdquo; or &ldquo;replicated virtual machine&rdquo; &ndash; and it was very encouraging when I realised that our two firms, completely independently, had both concluded that the correct architecture for a significant range of important financial services use-cases is the UTXO model.\nThis bears repeating: two firms who, in R3&rsquo;s case, had worked with a huge consortium of financial institutions on a groundbreaking year-long Architecture Working Group and, in the case of Digital Asset, had begun delivery of implementations for clients, had reached extremely similar conclusions about what the &ldquo;correct&rdquo; architecture should look like.\nBut, in reading the paper, it was also clear that we had made some different decisions, too.&nbsp; And the interesting thing is that&nbsp;the differences are&nbsp;almost all related to choices we&rsquo;d made about acceptable tradeoffs.&nbsp; As I&rsquo;ve often written, there are no perfect solutions in DLT; just tradeoffs. But I will also freely admit that we made some additions&nbsp;to Corda&rsquo;s technical vision in the light of the paper!\nSo it&rsquo;s time, I thought, to share my thoughts on what I think are the key points in the paper and outline how I think Corda could be a perfect way to implement the concept.\nWhat is the Global Synchronisation Log?\nAt the heart of this space is a beguilingly simple vision:\nDLT allows me to build systems where &ldquo;I know that what I see is what you see&rdquo;\nThat is: if a computer system that I own and run and which exists to serve my needs tells me something about a deal you and I have done, I want to know that the system you&rsquo;re looking at, that you own and run and which exists to serve your needs, is telling you the same thing.\nBefore Bitcoin and blockchains and Distributed Ledger Technology there were only two ways of doing this, neither of them perfect:&nbsp; 1) we could build a centralised infrastructure and just agree to agree that whatever they say is the truth&hellip; consensus by authority, if you like or 2) we could build our own systems and then spend all our lives checking that they had come to the same conclusion about everything&hellip; consensus by reconciliation.\nBitcoin and the systems it inspired showed us there was a third way:&nbsp; we could use advances in cryptography, consensus algorithms and other technologies to give ourselves near total assurance that our systems were in sync without having to employ armies of people to check.\nBut there was a problem&hellip; and this problem is at the absolute heart&nbsp;of everything that&rsquo;s going on in the DLT space today: the solution invented by Bitcoin and refined through subsequent systems depends on all data being shared with all parties.&nbsp; So you gain something amazing on one hand: an end to errors, duplication, inconsistency and associated risk. But, on the other hand, you create a privacy nightmare and a system that goes slower the more things you use it for.\nThis is precisely the conundrum that motivated the invention and development of Corda. We decomposed the building blocks of existing blockchain platforms and reassembled them in the light of the different threat-model we have, the different use-cases and different tradeoffs we are prepared to accept.\nOne of the key insights in our work was that, for our scenarios, we can separate transaction verification from the question of whether two verified transactions conflict with each other. I wrote about this when we first announced Corda in April last year.\nWe think the&nbsp;question of transaction verification should be down to the transaction participants: if one of them pretends that their smart contract produced a different answer to what it actually did then we&rsquo;ll deal with it out-of-band; it&rsquo;s a permissioned system and we know who they are&hellip; &nbsp; They gain nothing by playing games like that.\nBut the question of which transactions actually get confirmed&nbsp;is a question for an independent observer; we need somebody we all trust to choose between two equally valid but conflicting transactions. At R3, we call this observer a notary but that&rsquo;s just the name we use to generalise the role performed by miners in a traditional blockchain.\nIn so doing, we addressed&nbsp;many of the privacy and scalability issues of other platforms at a stroke.\nBut it&rsquo;s a tradeoff, of course. &nbsp;Because there&rsquo;s something that a full public blockchain gives you that this approach doesn&rsquo;t. Both approaches assure you that only&nbsp;valid transactions can get confirmed, but a full public blockchain also ensures that everybody gets to know when this happens.\nBut, of course, a traditional blockchain&nbsp;does this by using full broadcast, in the clear, of pretty much everything that happens. A privacy and scalability disaster.\nSo we had some very heated debates when we designed Corda about which tradeoffs were acceptable and which ones were not. And the GSL paper touches on all of them really succinctly.\nTwo of the more important debates were as follows:\nIf I send a full transaction to a notary (think &lsquo;miner&rsquo; in a traditional blockchain), that could be a privacy leak: the notary gets to see all the data in the transaction. But if I only send the pieces of the transaction that the notary actually needs to see in order to decide transaction ordering then I could execute a &ldquo;denial of state&rdquo; attack by having the notary confirm an invalid transaction that &ldquo;consumes&rdquo; an input and stops a valid transaction from subsequently being confirmed.\nIf I send a transaction to a notary, how does it know which other parties to inform? I could execute an attack whereby I get a transaction confirmed but the other side doesn&rsquo;t learn about it&hellip; that might allow me to selectively choose not to reveal it if it so suits me.\nIn Corda, we made the following observations. We said:\nThe &ldquo;notary privacy versus denial-of-state&rdquo; question is one that sh…",
                "fallback": "Richard Gendal Brown Link: Towards Deeper Collaboration in Distributed Ledgers: Thoughts on Digital Asset’s Global Synchronisation&nbsp;Log",
                "from_url": "https:\/\/gendal.me\/2017\/01\/24\/towards-deeper-collaboration-in-distributed-ledgers-thoughts-on-digital-assets-global-synchronisation-log\/",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/80e52697fe656b705b8e007d2b72e6db?s=114",
                "id": 1
            }
        ],
        "ts": "1485330210.000073",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0ULX737C",
                    "U0VKPD6A2"
                ],
                "count": 2
            }
        ]
    }
]