[
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "so the general context goes like this:\n- a smart contract needs input from an external source (e.g price of a particular stock, bank balance of a particular account,  at a given point in time)\n- by design smart contracts are prohibited from directly contacting outside world (no access to network, file system, etc.)\n- an intermediary of some sort is needed to supply this input to the SC execution\n- this intermediary must prove that the data it relays is identical to the data obtained from the external source at the given point in time\n- if some parts of the intermediary runs off of the blockchain network, the “proof” must include attestation of secured execution of code to guard against attacks on hardware and vm\/os level",
        "ts": "1464096475.000002"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "another piece of information is that most API providers don’t sign their output, as a result when the output passes through an intermediary, there’s no guarantee that it hasn’t been modified before it’s passed along to the requester",
        "ts": "1464096602.000003"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "if the above sufficiently covers the requirements, then I think the Town Crier project addresses them pretty well",
        "ts": "1464096975.000004"
    },
    {
        "type": "message",
        "user": "U0XQ35CDD",
        "text": "curious: what's the drawback of the Oraclize\/TLSnotary approach compared to Town Crier?",
        "ts": "1464097051.000005"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "my understanding is that this requires a 2 step procedure: 1) the data is retrieved using a TLSnotary client and 2) oraclize proves that the data was retrieved using TLSnotary",
        "ts": "1464097174.000006"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "so the proof is on data level, that it hasn’t been altered after it was obtained from the source. but i think there are other questions I don’t know if oraclize addresses, for instance have the request parameters been altered after it entered the intermediary (the oraclize server)? in other words i don’t believe there’s proof that the AWS servers hosting the service haven’t been tempered with, or if there’s no malicious os-level or application-level code that tries to modify the parameters.",
        "edited": {
            "user": "U13TWBRBL",
            "ts": "1464100074.000000"
        },
        "ts": "1464099050.000007"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "another limitation of Oraclize is that it only supports public APIs",
        "ts": "1464101948.000009"
    }
]