[
    {
        "type": "message",
        "user": "U2E87MX1A",
        "text": "Okay, thanks for your answer. The most important part is that indeed, I need the chaincode to encrypt some payload. I would like it to use, for example, the callers public key, so only he could decrypt it using its own private key. In fact I need the chaincode to encrypt data somehow but not with keys stored on the blockchain because then anyone could look at the raw blockchain and decrypt that data.",
        "ts": "1482485644.000885"
    },
    {
        "type": "message",
        "user": "U2E87MX1A",
        "text": "As far as I know <@U1TA5FDU7> even though I include those certificates in the metadata, if I write on the chain, the written data is not encrypted, so with a raw look at the blockchain anyone could read it.",
        "ts": "1482485876.000886"
    },
    {
        "type": "message",
        "user": "U1TA5FDU7",
        "text": "<@U2E87MX1A> how can they read the written data? if they don't show the signature, they don't have the privilege to access your data, even the encrypted data. These Access and Control should be coded in your Query function.  Your meaning is that everyone can access your written data, and you want to encrypt it so they cannot read it. And your problem is how to distribute your private key which is used to encrypt the data to your partner.  As I know, chaincode cannot solve this. I think this problem can be solved in a higher level. It's a key distribution problem.",
        "ts": "1482487723.000887"
    },
    {
        "type": "message",
        "user": "U2E87MX1A",
        "text": "<@U1TA5FDU7> What i mean is, data is stored on the chain, so any user with access to a node can take a look at the block transactions and see what is stored if it is not encrypted. And what I want to know is if chaincode can access callers private and public keys so I can use them to encrypt and decrypt data.",
        "ts": "1482490693.000888"
    },
    {
        "user": "U3EF4NL01",
        "text": "<@U3EF4NL01|111ibm111> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1482496483.000889"
    },
    {
        "type": "message",
        "user": "U3EF4NL01",
        "text": "When confidentiality is turned on, the payload of block is encrypted.\nHow can I decrypt this payload in the block?\nWhich API can i invoke?",
        "ts": "1482496762.000890"
    }
]