[
    {
        "type": "message",
        "user": "U0N1ST4MN",
        "text": "<@U0KM61BCP> Oasis is good stuff, but top down approach. Requires that everybody agrees to the Standard before it can really be used. Meanwhile CommonAccord can be used today. You can take any doc and “codify” it so that it can be used. It can comply with Oasis standard but does not have to if your needs are outside of what is available",
        "ts": "1460964557.000012"
    },
    {
        "type": "message",
        "user": "U0N1ST4MN",
        "text": "We will discuss these issues with all who are working on this topic at the end of May <http:\/\/www.commonaccord.org\/index.php?action=doc&amp;file=S\/About\/Conference\/Flyer\/0.md>",
        "ts": "1460964953.000013"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U0N1ST4MN>: the OASIS standard is nearly a decade in the field as a standard. ",
        "ts": "1460974576.000014"
    },
    {
        "type": "message",
        "user": "U0W7D64LC",
        "text": "I was trolling through the fabric issues list and here are some relatively low-hanging problems to be solved. Members all over, have always been available on slack or via the issues to assist. So don’t hesitate to ask for help\/guidance\/further explanation, and don’t stop here, this is just a quick kick starter list of what should be fairly easy items to tackle. Please jump out there on any of these issues, or others, and thank you for any\/all help you can provide! Will add more soon...\nissue 562 - Sample app issuing REST calls to run chaincode\nissue 662 - Capture stacktrace on error\nissue 724 - Remove existing containers for chaincode if not already connected.",
        "ts": "1460985981.000015"
    },
    {
        "type": "message",
        "user": "U0ULK2JPP",
        "text": "I think issue 724 was fixed.",
        "ts": "1460986336.000016"
    },
    {
        "type": "message",
        "user": "U0ULK2JPP",
        "text": "let me add a comment to the issue asking if this can be closed",
        "ts": "1460986348.000017"
    },
    {
        "type": "message",
        "user": "U0NCW1DPX",
        "text": "Will try to work on 662 after I finish my business travel in this week ",
        "ts": "1460991126.000018",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0W7D64LC"
                ],
                "count": 1
            }
        ]
    }
]