[
    {
        "type": "message",
        "user": "U31A496G2",
        "text": "How can I generate unique ids for my Key\/Value pairs when storing values within my chaincode? Although I understand that I cannot return a value back to the caller using invoke. Is there any way I can achieve this?",
        "ts": "1485247347.000231"
    },
    {
        "user": "U3VFJD42F",
        "text": "<@U3VFJD42F|choojoyq> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485265646.000232"
    },
    {
        "type": "message",
        "user": "U3VFJD42F",
        "text": "Hello, could you please help me with deployment of java chaincode with gradle multi-project in 0.6 version. I have a module which provides common classes for my other modules, for example module 'common' and module 'm1' which depends on it. During chaincode deployment i point peer to the folder with 'm1' source code and build.gradle file with mainClassName property. Sequence of steps that i noticed during deployment, correct me if i'm wrong : 1. Fabric starts new docker container. 2. Copies files from m1 directory to chaincode directory. 3. Runs grade clean &amp;&amp; gradle build in this directory. So the issue is with step 3. Could you please explain why fabric required source code and build file during deployment instead for compiled archives (jar files for example)? This causes issue with referencing the 'common' module, cause i can't pass this directory during deployment and reference it using relative path, i can't reference it from maven local as well, cause docker container has its own m2 home directory which doesn't have this module(but i noticed that container knows about java-shim, i believe this reference presents in docker image file). Is it possible to deploy chaincode from 'm1' directory and reference 'common' jar  without publishing it to remote maven repository?",
        "ts": "1485266169.000233"
    },
    {
        "type": "message",
        "user": "U0YNFB22X",
        "text": "<@U3VFJD42F> You can place the 'common' jar lib in a folder under your current project structure and use file dependency in gradle, That way your jar will be packaged and sent to docker image",
        "ts": "1485323326.000234"
    }
]