[
    {
        "type": "message",
        "user": "U1P1ZV6RF",
        "text": "In Consensus FAQ there is a typo or the whole sentence about default consensus implementations has to be rewritten. It says there will be 3 of them whereas the text explicitly mentions only 2 (Noops and PBFT): <http:\/\/hyperledger-fabric.readthedocs.io\/en\/latest\/FAQ\/consensus_FAQ\/>",
        "ts": "1473620083.000015"
    },
    {
        "type": "message",
        "user": "U1P1ZV6RF",
        "text": "I am slightly confused with an answer to FAQ on centrality of Membership Service: In my opinion the simple task of issuing certificates from a single location makes Fabric partially centralistic. If Membership Services cease to function correctly, no certificates are issued and thus, no transactions can be processed and no new members can be enrolled. I would develop this topic further to highlight that there is a possibility to set up highly available or redundant membership services nodes in two geographically separated locations: <http:\/\/hyperledger-fabric.readthedocs.io\/en\/latest\/FAQ\/identity_management_FAQ\/>",
        "edited": {
            "user": "U1P1ZV6RF",
            "ts": "1473620493.000000"
        },
        "ts": "1473620423.000016"
    },
    {
        "type": "message",
        "user": "U1P1ZV6RF",
        "text": "With regards to the performance goal documented here (<http:\/\/hyperledger-fabric.readthedocs.io\/en\/latest\/FAQ\/usage_FAQ\/>) I think we are nowhere near this figure. Bluemix website shows 240tx\/s ; Digital Assets guys managed to perform 400tx\/s with Noops. Do we have a documented evidence that we are nearing 100K tx\/s?",
        "ts": "1473620606.000018"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "the performance goal is a GOAL, nowhere does it claim that the current performance capability is 100k tps",
        "ts": "1473621632.000019"
    },
    {
        "type": "message",
        "user": "U1P1ZV6RF",
        "text": "fair enough",
        "ts": "1473621806.000020"
    },
    {
        "type": "message",
        "user": "U1P1ZV6RF",
        "text": "but where are we now from performance perspective vs number of nodes in a PBFT setup?",
        "ts": "1473621854.000021"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U1P1ZV6RF> as for the first point, yes, that’s a typo. There are only two presently. However, there is active work underway to refactor consensus",
        "ts": "1473622033.000022"
    }
]