[
    {
        "type": "message",
        "user": "U184J2R7S",
        "text": "<@U2DHRR4TE> I think the developers you should ask are on fabric-consensus-dev channel now.  you may want to post your questions there.",
        "ts": "1482151942.000026"
    },
    {
        "user": "U1FBDMBMG",
        "text": "<@U1FBDMBMG|ryokawawork> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1482208115.000027"
    },
    {
        "type": "message",
        "user": "U1FBDMBMG",
        "text": "Hi. I have a question on the behavior of synchronization and the checkpoint. I am using Fabric v0.6.0, and 4 nodes,     - CORE_PEER_VALIDATOR_CONSENSUS_PLUGIN=pbft\n    - CORE_PBFT_GENERAL_K=10\n    - CORE_PBFT_GENERAL_BATCHSIZE=1\nWe were testing the synchronization behavior when one of the four node gets down for a while and restarted and back to the network again. In this case, the height of the restarted node is behind that of other nodes. User sent 60 transactions and the node started synchronization and completed synchronization. The user continued sending transactions, but the height of the restarted node did not grow. After sending 120 transactions, the node synchronized again. This sequence pattern was repeated at 60th, 120th, 180th, ... transaction after the restart.",
        "ts": "1482209416.000028"
    },
    {
        "type": "message",
        "user": "U1FBDMBMG",
        "text": "My questions are: 1. Why the synchronization occurs at 60xN-th transactions? 2. Why the restarted node does not accept new transactions after it was synchronized?",
        "ts": "1482210005.000029"
    },
    {
        "type": "message",
        "user": "U1FBDMBMG",
        "text": "and , how can we predict the timing of synchronization from the value of K, or the batch size? I expected that the checkpoint occurs at K=10 transactions and synchronized at that timing ...",
        "ts": "1482210111.000030"
    },
    {
        "type": "message",
        "user": "U1FBDMBMG",
        "text": "Any information or link or comments are welcome. Thank you.",
        "ts": "1482210145.000031"
    },
    {
        "type": "message",
        "user": "U2CBG8V9U",
        "text": "<@U1FBDMBMG>  have you set the viewchangeperiod to 6? this settings is to decide at n*checkpoint, the synchronization occurs.",
        "ts": "1482213511.000032"
    }
]