[
    {
        "user": "U0MJ8DFB3",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0MJ8DFB3|andreas.fletcher> has joined the channel",
        "ts": "1462953168.000087"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U0ULK2JPP>: can you please share the “spec for events” when you are able to locate it?",
        "ts": "1462969891.000088"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U0PB67X4K>: so the implementation of a messaging support may not need a queue because we could treat the ledger as the queue, but I think some questions still remain, for instance, what would the application be expected to do?",
        "ts": "1462970199.000089"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "i could see the fabric provide a “messaging client” component that can be run inside a microservice for the purpose of application integrations (just like the SDK)",
        "ts": "1462970267.000090"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "because there’s still a lot of specific messaging-related concerns that this client library needs to do, keeping track of committed offsets for instance, that’s not trivial to code up",
        "ts": "1462970497.000091"
    },
    {
        "type": "message",
        "user": "U0KQ9QKH6",
        "text": "I can say that certain events within our use case would be interesting to those reviewing the history\/sequence of transactions on the ledger(regulators). Having event data in the ledger is appealing from that standpoint",
        "ts": "1462970764.000092"
    },
    {
        "type": "message",
        "user": "U0KQ9QKH6",
        "text": "having a messaging client would help with coordination between external entities and other chaincode, but doesn't address the history aspect",
        "ts": "1462970878.000093"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U0KQ9QKH6>: agreed, having a “messaging system\" on top of the events support would make it much easier for applications to interact with the ledger in real-time or in typical manners applications integrate through messaging",
        "ts": "1462971272.000094",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1A5P979S"
                ],
                "count": 1
            }
        ]
    },
    {
        "user": "U17F0A68Y",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U17F0A68Y|lhy555> has joined the channel",
        "ts": "1463033984.000095"
    }
]