[
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "_____________\nUnEnrolling\n_____________",
        "ts": "1468000613.000165"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "Hi all, just spotted this discussion (from yesterday eve\/night)",
        "ts": "1468000635.000166"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "*ibmamnt* 6:27 PM <@U0S5KF44D>: Is there any plan to unregistrar or something like this from membersvc, so that we do not need to delete \/var\/hyperledger\/productions. This is simply because I do not have permission to access membersvc production server(s).\n\n*keithsmith* 10:17 PM yes … see <https:\/\/github.com\/hyperledger\/fabric\/issues\/1620> and feel free to comment\n\n*ibmamnt* 2:08 AM <@U0S5KF44D>: Thanks. I have subscribed to that record (#1620).",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "Unable to Enroll user after being unEnrolled - ECA.db user state need to be reset · Issue #1620 · hyperledger\/fabric · GitHub",
                "title_link": "https:\/\/github.com\/hyperledger\/fabric\/issues\/1620",
                "text": "When un-enrolling a User using REST API: DELETE host:port\/resgistrar\/{enrollmentID} and trying to re-enroll it using the new enrollSecret (fetched from the eca.db ,table :Users) i get the followin...",
                "fallback": "GitHub: Unable to Enroll user after being unEnrolled - ECA.db user state need to be reset · Issue #1620 · hyperledger\/fabric",
                "thumb_url": "https:\/\/avatars0.githubusercontent.com\/u\/19368034?v=3&s=400",
                "from_url": "https:\/\/github.com\/hyperledger\/fabric\/issues\/1620",
                "thumb_width": 420,
                "thumb_height": 420,
                "service_icon": "https:\/\/a.slack-edge.com\/e8ef6\/img\/unfurl_icons\/github.png",
                "id": 1
            }
        ],
        "ts": "1468000709.000167"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "(in the client-sdk\/GitHub)",
        "ts": "1468000722.000169"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "I can (and will) probably add some comments on GitHub, but first, I'm also happy to discuss this here (first)",
        "edited": {
            "user": "U11MANG9G",
            "ts": "1468000769.000000"
        },
        "ts": "1468000752.000170"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "So Enrollment effectively conveys\/provides one with an Enrollment Certificate (ECert)",
        "ts": "1468000800.000172"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "It is a much stronger concept (to me), than a log-in\/log-out...",
        "ts": "1468000834.000173"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "Intuitively, the way I see\/approach a request to 'delete my Enrollment' (especially from the DB), ... is similar to FB asking me if I would like to commit a `social suicide` when I'm asking to 'unenroll' from FB.",
        "ts": "1468000972.000174"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "I'm happy to discuss this further (here), but if there are no objections\/comments, I'll go ahead and put\/add my thoughts\/comments on the issue.",
        "ts": "1468001069.000175"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "WDYT ?",
        "ts": "1468001081.000176"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "yes, register\/unregister is equivalent to addUser\/removeUser which is much more than login\/logout",
        "ts": "1468002415.000177"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "Yup, it has to be... therefore, my inclination is not to be able to reuse the enrollment, nor the certificate. Happy to hear more thoughts, and then I'm off to GitHub :wink:",
        "ts": "1468003099.000178"
    },
    {
        "type": "message",
        "user": "U16Q0J0E6",
        "text": "If the reason for unenrolling is because of suspected compromise or non-recoverable loss of the enrollment private key, the standard way to deal with this would be ECert revocation disseminated via CRL or OCSP\/OCSP stapling so that relying parties can retrieve trusted notification. In that case, a user should be allowed to reenroll if they can provide the Registration Authority with fresh proof of ECert issuance eligibility, such as proof of UserID and Affiliation included within an issued ECert. There is also the issue of whether the same UserID or (effectively equivalent UserID) should be able to be associated with concurrently valid ECerts that each have distinct (proven eligibility\/ownership) Affiliations.",
        "ts": "1468005739.000179"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "Yes, I was thinking along these lines, which is why I used the `social suicide` example from FB - effectively, I view such DELETE request as the request to terminate the account. Keith put together a short list that I'll relate to as well (as to whom should be allowed to perform that action).",
        "ts": "1468031120.000180"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "\"my inclination is *not to be able to reuse the enrollment, nor the certificate*\" == *certificate revocation* (in PKI terms, yes)",
        "edited": {
            "user": "U11MANG9G",
            "ts": "1468031537.000000"
        },
        "ts": "1468031190.000181"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "<@U16Q0J0E6>: I agree with the second part, but I'd focus on the first - as it seems to me\n i) more burning\/important as we define requirements. We have the placeholders for the revocation, etc.\n(ii) immediate need as we want to get the basic workflow working well.",
        "ts": "1468031326.000182"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "That is, let's allow\/focuson\/get the dynamic enrollment + revocation to work first, then worry about the multiple EIDs per user, with or w\/o proven Affiliations. (I do completely agree that it's important too, probably right after we handle the first part).",
        "ts": "1468031633.000189",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0N37A0AD"
                ],
                "count": 1
            }
        ]
    }
]