[
    {
        "user": "U1GLPP8QN",
        "text": "<@U1GLPP8QN|deeflorian> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1475148319.000335"
    },
    {
        "type": "message",
        "user": "U221LL03Z",
        "text": "<@U1CTBUNEN> : We are going to keep the concept and implementation of Pre-Key as it stands today(We might add some other variant , if that seems appropriate). So , you should not be worried on that front. Our next problem to solve is how to manage those pre-Keys etc. Also , something like delegation , can be handled at Enterprise Level etc. by virtue of LDAP implementation (which is defacto standard for user management). For users with roles that cannot be tied back to Enterprise Role , we have to provide those capabilities at Memebership Services level.",
        "ts": "1475156920.000336"
    },
    {
        "type": "message",
        "user": "U221LL03Z",
        "text": "The doc mentioned above does not talk about these in details , but we'll produce a doc to share with community.",
        "ts": "1475156996.000337"
    },
    {
        "type": "message",
        "user": "U221LL03Z",
        "text": "You should read doc keeping in mind that users might not be using full blown capabilities being offered by membership services , e.g. some user(s) might not want to use ECert being created by Membership services, they want to bring their own. Some users might not want to use membership services at all. The doc provides abstraction as to what will be offered by Memebership Services , giving flexibility to users to choose from.",
        "ts": "1475157253.000338"
    },
    {
        "type": "message",
        "user": "U1CTBUNEN",
        "text": "<@U221LL03Z> thanks for the detailed information. I think striving for maximum flexibility on the is the right path for the identity management piece",
        "ts": "1475168513.000339"
    },
    {
        "user": "U2HSRQXGQ",
        "text": "<@U2HSRQXGQ|shannon_wie> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1475215061.000340"
    }
]