[
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "team - really need to focus on tests for fabric-cop repo",
        "ts": "1478348557.000908"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "I also started <#C2Y3CPP16|fabric-cop> as well since we should start using the name of the project",
        "ts": "1478348660.000909"
    },
    {
        "user": "U2MT7PA4W",
        "text": "<@U2MT7PA4W|sidthekid> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1478356203.000910"
    },
    {
        "type": "message",
        "user": "U2MT7PA4W",
        "text": "Hey everyone, I had a beginner question about membership services: This is what the IBM Bluemix docs say about registering-\n&gt;peers will be expecting a validated enrollId on most API requests. Therefore, the first step is we need to use the \/registrar API endpoint to register an enrollId. This creates a binding of sorts between the ID and the peer such that this enrollId cannot be used on any other peer. It's relatively safe to think of this step as registering an API key with a particular peer. The SDK does almost all the work here for us. It will first parse network.peers[] and network.users[] and run 1 POST \/registrar HTTP request per peer. It will send the first enrollId to the first peer, and the second ID to the second peer and so on until every peer has 1 ID.",
        "edited": {
            "user": "U2MT7PA4W",
            "ts": "1478356572.000000"
        },
        "ts": "1478356560.000911"
    },
    {
        "type": "message",
        "user": "U2MT7PA4W",
        "text": "Does that really mean each peer requires each user to register with it first before making API requests? What does an enrollID represent? This section isn't clear to me, should I use `enrollID`s to represent a USER database table for a webapp?",
        "edited": {
            "user": "U2MT7PA4W",
            "ts": "1478356750.000000"
        },
        "ts": "1478356666.000913"
    }
]