[
    {
        "type": "message",
        "user": "U2DHRR4TE",
        "text": "Hey all, does anyone know how you;d go about finding the name of the user whose made a chaincode invocation in v0.6? (v0.5 had the common name in the transaction certs but that no longer is the case)",
        "ts": "1474963670.000287"
    },
    {
        "type": "message",
        "user": "U1B4VFD3J",
        "text": "One way could be to add the username as an attribute in the certs. But im curious to hear if there is a nicer way of doing it",
        "ts": "1474964087.000288"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "<@U2DHRR4TE>  - transaction certificates were specifically created to hide the user name of the caller.  There was an error in the v0.5 code where we actually included the enrollID in the common name for transaction certs but that hole was closed.   You have 2 options:\n\n1) Use enrollment certificates rather than transaction certificates\n2) Use the attributes mechanism provided by membership services and carried within transaction certificates",
        "ts": "1474970396.000289"
    },
    {
        "type": "message",
        "user": "U2DHRR4TE",
        "text": "Ah ok, is there example code anywhere of using enrollment certificates?",
        "ts": "1474970484.000290"
    },
    {
        "type": "message",
        "user": "U1CTBUNEN",
        "text": "boy I haven't been that excited about new tech since IRC lol",
        "ts": "1474975032.000291"
    },
    {
        "user": "U26BX6S3B",
        "text": "<@U26BX6S3B|pmcosta> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1474980241.000292"
    },
    {
        "user": "U130QV7RB",
        "text": "<@U130QV7RB|mpage> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1474991595.000293"
    },
    {
        "user": "U1TMQDYKE",
        "text": "<@U1TMQDYKE|wil.pannell> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1475012227.000294"
    },
    {
        "type": "message",
        "user": "U12452RAP",
        "text": "<@U11MANG9G> i have a question that if I want to dynamic register peer user, it seems now only grpc API. However I think it should provider a CLI for this operation",
        "ts": "1475033519.000295"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U12452RAP> There is a story for this at <https:\/\/jira.hyperledger.org\/browse\/FAB-241>.  If you know node.js, it would not be difficult to enhance fabric\/sdk\/node\/bin\/main.js to support the “hfc login” and “hfc register” commands to do this.  If you’re interested, feel free to ping me, but you should also mention this on the fabric-sdk channel before you begin.  This would be a good start to FAB-241",
        "ts": "1475042530.000296"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U2DHRR4TE> The short answer is that there is no sample for using ECerts, but it should be possible without too much work.  Are you using the node client SDK?",
        "ts": "1475042772.000297"
    },
    {
        "type": "message",
        "user": "U12452RAP",
        "text": "<@U0S5KF44D> thanks for point out. However I have some confusion as in future we should have several SDK including node,python,java, is that mean each SDK need provide a CLI tool? Refer to peer CLI, should we also add CLI in membersrvc?",
        "ts": "1475043256.000298"
    }
]