[
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "<@U0N4P17ND> Sorry I’m late in seeing your question.  I’m pasting here again to respond",
        "ts": "1476100363.000603"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "Hi, question regarding mbrsvc architecture in v1: what will happen if somebody gain control over one of the meberservcies instances? Theoretically it can start issue new certificates and new peers will join network, which can take a control over the network? This was an issue in v.05 but now we mbrsvc is distributed so how this case is prevented is there any use case description for such scenario? Which architecture should customer use to prevent such scenario?",
        "ts": "1476100366.000604"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "You are talking about a sybil attack by adding new peers when one membersrvc is compromised",
        "ts": "1476100440.000605"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "this will not be possible for the following reason",
        "ts": "1476100452.000606"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "The blockchain network is bootstrapped with multiple CA root certificates which everyone agrees upon and will be part of the genesis block.  Also part of the genesis block is a policy for adding new CA root certificates.  Let’s assume the policy is the unanimous policy.",
        "ts": "1476100665.000607"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "In order to add a new root CA certificate to the network, you must have the signature\/approval of all existing CAs",
        "ts": "1476100715.000608"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "assuming “unanimous” policy to add new root CA certs",
        "ts": "1476100736.000609"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "Now, transactions are sent to peer’s yes, but the endorsement policy is based on a signature by a CA.   So no matter how many peers there are associated with a CA \/ membership services \/ COP server, the endorsement policies count at the CA level, not at the peer level",
        "ts": "1476101039.000610"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "So in a nutshell, 2 things prevent a sybil attack:",
        "ts": "1476101295.000611"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "1) Endorsement policies count root CA signatures (aka “participants” in some of the doc), not peer signatures",
        "ts": "1476101361.000612"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "2) Adding new root CAs (aka “participants”) require approval by other CAs based upon some agreed upon policy",
        "ts": "1476101403.000613"
    },
    {
        "type": "message",
        "user": "U0S5KF44D",
        "text": "I hope this makes sense",
        "ts": "1476101422.000614"
    },
    {
        "type": "message",
        "user": "U0N4P17ND",
        "text": "Thanks <@U0S5KF44D> ",
        "ts": "1476102681.000615"
    },
    {
        "type": "message",
        "user": "U221LL03Z",
        "text": "@oikovlev , I did not think your question was directly related to sybil attack. Please let me know . if I misunderstood you.",
        "ts": "1476153810.000616"
    }
]