[
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "<@U1RLLLQCU>  - you want to use v0.6.1-release-preview now and yes events are implemented in both the fabric and the sdk",
        "ts": "1477387854.001069"
    },
    {
        "user": "U1M9R3C8Z",
        "text": "<@U1M9R3C8Z|rascal> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1477388513.001070"
    },
    {
        "type": "message",
        "user": "U1RLLLQCU",
        "text": "<@U0PB67X4K> We still on 0.6.0-preview version of the hyperledger\/fabric and using 0.6.1 version of HFC\n\nWhen we try to register for chaincode or block events through registerChaincodeEvent, registerBlockEvent through the Chain.EventHub as per the chain-tests.js, the callback function doesnt gets invoked, however new  blocks are being added and chaincode invoke are successfull on chaincode, checked. \n\nAlso, see an error after chain.eventHubConnect, E1025 09:27:14.732553520    4436 resolve_address_posix.c:126] getaddrinfo: Name or service not known",
        "ts": "1477388735.001071"
    },
    {
        "user": "U0UGH3X7X",
        "text": "<@U0UGH3X7X|tuand> has left the channel",
        "type": "message",
        "subtype": "channel_leave",
        "ts": "1477408958.001074"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U1RLLLQCU> this error usually happens when your target endpoint (host ports) are not properly configured, note that event stream is typically on port 7053",
        "ts": "1477416260.001075"
    },
    {
        "type": "message",
        "user": "U1RLLLQCU",
        "text": "<@U13TWBRBL> How do i find out if the host ports are properly configured or not? I started membersrvc and peer. Do i need to do some extra configuration for the event stream so that it can be connected from HFC node.js SDK?",
        "ts": "1477453004.001078"
    },
    {
        "type": "message",
        "user": "U1RLLLQCU",
        "text": "<@U13TWBRBL> <@U0PB67X4K> I upgraded to HFC 0.6.2, but the hyperledger\/fabric is still on 0.6.0-preview version. \nNow I dont receive the Name or service not known error which is received with HFC 0.6.1\n\nBut still the callback functions of registerChaincodeEvent, registerBlockEvent through the Chain.EventHub are never invoked.",
        "ts": "1477459726.001079"
    },
    {
        "type": "message",
        "user": "U1RLLLQCU",
        "text": "<@U13TWBRBL> <@U0PB67X4K> When i upgraded to HFC 0.6.4, i am starting to receive the block events through registerBlockEvent. \nHowever, I still don't receive the chaincode events through registerChaincodeEvent. \nWhat should be the eventname supplied to the registerChaincodeEvent function? In the examples event-tests.js it is mentioned as \"^evtsender$\". Is it a catch-all name for chaincode events?\n\nPlease note i am still using hyperledger\/fabric on v0.6.0-preview",
        "ts": "1477465183.001081"
    }
]