[
    {
        "type": "message",
        "user": "U1AU8DRQR",
        "text": "<@U1Y2R5C9L> do we have a JIRA for that?",
        "ts": "1478767085.000368"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "<@U1AU8DRQR>  No",
        "ts": "1478767372.000369"
    },
    {
        "type": "message",
        "user": "U1AU8DRQR",
        "text": "<@U1Y2R5C9L> should I look into node\/sdk as a reference implementation?",
        "ts": "1478767508.000370"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "yes <@U1AU8DRQR> starting point would be TCertGetter and implementing the algorithms to decrypt the tcerts",
        "ts": "1478767572.000371"
    },
    {
        "user": "U2N1D7C07",
        "text": "<@U2N1D7C07|ercw> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1478777294.000372"
    },
    {
        "type": "message",
        "user": "U2N1D7C07",
        "text": "Hi all, I would like to know the status of this java SDK. Does it provide all functionality the golang fabric does or is it a work-in-progress?",
        "ts": "1478777369.000373"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "WIP",
        "ts": "1478778525.000374"
    },
    {
        "type": "message",
        "user": "U2N1D7C07",
        "text": "thanks a lot",
        "ts": "1478778572.000375"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "feel free to start contributing  :wink:",
        "ts": "1478778591.000376"
    },
    {
        "type": "message",
        "user": "U2N1D7C07",
        "text": "could you give any more details on whether I could expect to use it to create basic hyperledger apps yet?",
        "ts": "1478778613.000377"
    },
    {
        "type": "message",
        "user": "U0PB67X4K",
        "text": "I guess it might depend on which version of the Hyperledger Fabric you are using, but I'll let the folks who are actually doing the implementation respond.  I am more familiar with the Node.js SDK and the Golang stuff",
        "ts": "1478778749.000378"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "<@U2N1D7C07> This is new SDK and there has been no release so far. Currently, this implements the following functionalities:\n1. Enrolling and registering members\n2. Deploying, invoking and querying chain code - GOLANG and Java chaincodes are supported, security should be disabled - no TCerts",
        "ts": "1478779378.000379"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "The SDK APIs are still being designed and the focus is to implement the V1 APIs, since a lot in the V1 space is not yet clear in the crypto and membership services domain, it could be a while before you get a fully functional SDK.",
        "ts": "1478779624.000380"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "If you could let us know what APIs you are specifically after, we may be able to prioritize them sooner",
        "ts": "1478779675.000381"
    },
    {
        "type": "message",
        "user": "U2Q0HP4HY",
        "text": "Hi I'm working on the V1 side of the API.  I had targeted to deliver something end of the week for review but partially due to server side changes that's looking more like Monday.  Functionally  it Deploys, Invokes and Queries the chain.  When delivered it will NOT be fully to the API spec as it's evolving and my goal has been to keep something working.  There will definitely be changes to this API implementation to conform to spec that will impact anyone building on it.",
        "ts": "1478781372.000382"
    },
    {
        "type": "message",
        "user": "U2N1D7C07",
        "text": "Thank you s so much <@U1Y2R5C9L> !",
        "ts": "1478782314.000383"
    },
    {
        "type": "message",
        "user": "U2N1D7C07",
        "text": "Does that mean that alot is still unclear in the GOLANG implementation? I read a lot of companies using Hyperledger to do all sorts of incredible stuff already so it's surprising that a lot of elements still haven't fallen in to place",
        "ts": "1478782440.000384"
    },
    {
        "user": "U2RCN8W95",
        "text": "<@U2RCN8W95|lanzen> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1478787142.000385"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "<@U2N1D7C07> yes, the V1 is still under development on server side as well. The v1 will be very different to the current version of fabric (v0.6) which is currently being used by people to build applications. Although internal details will change, application level APIs implemented by SDKs will be similar (of course many new APIs will be introduced).",
        "ts": "1478817794.000386"
    }
]