[
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U13TWBRBL> <@U2Q0HP4HY> <@U0YQK8WSV> <@U1Y2R5C9L> just reviewed yesterday's discussion",
        "ts": "1481635700.000079"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "I'm glad to see that we are trying to collaborate more - this is goodness",
        "ts": "1481635719.000080"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "I think, though, that there needs to be a change in how we work to enable this level of collaboration",
        "ts": "1481635744.000081"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "I went through this with the IBM squads, TBH (and some are still being coached;-) so this is not uncommon problem in learning how to be most effective at collaborating in open source with people not sitting in the same office",
        "ts": "1481635831.000082"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "point one: submit smaller changesets that move the ball slightly, rather than trying to merge a major refactor all at once in the midst of a moving target project as large and as active as Fabric",
        "ts": "1481635915.000083"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "by small, I mean less than 200 LOC ideally, _with tests_",
        "ts": "1481635937.000084"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "this could mean that you are adding refactored capability that is not fully enabled excepting via tests until the new capability is fully ready to be activated (eg via feature flag, etc)",
        "ts": "1481635988.000085"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "Why do I say small? Because smaller changesets means quicker review - a 1k LOC changeset could take a weekend to review",
        "ts": "1481636079.000086"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "point two: as was suggested above, share the planning and decompose work in discrete tasks that can be independently worked",
        "ts": "1481636132.000087"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "you can, for instance, write a new function, add its tests (both happy path and the various negative tests) independent of any USE of that new function excepting by the tests",
        "ts": "1481636209.000088"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "then, once that is merged, you can start to add the calls to the new function (you can even mete this out gradually, again, adding tests where appropriate",
        "ts": "1481636250.000089"
    },
    {
        "type": "message",
        "user": "U2Q0HP4HY",
        "text": "May I add we should be opening up JIRA's that describe the work we are doing so it's clearly communicated",
        "ts": "1481636371.000090"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "absolutely, that is implied in my comment immediately above",
        "ts": "1481636428.000091"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "if there needs to be a major refactor, then I would strongly recommend that it be discussed in slack or email and that the the agreed approach be documented in JIRA and assignments (short ones!) be meted out",
        "ts": "1481636517.000092"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "it is important to have as much transparency as possible",
        "ts": "1481636663.000093"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "and it is important that the changes be incremental so that the disagreements (inevitable) can be minimized",
        "ts": "1481636684.000094"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "I'd also recommend that there be consideration of adding more maintainers to help with reviews - maybe change the policy to 2+2 to ensure agreement",
        "ts": "1481636792.000095"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "finally, we should really get Jenkins CI set up for this project",
        "ts": "1481636879.000096"
    },
    {
        "type": "message",
        "user": "U0YQK8WSV",
        "text": "<@U0KM61BCP> Thx for suggestions.. we will definitely start using JIRA to get broader community involvement and to add more committers.  CI is on my todo list.",
        "ts": "1481657195.000097"
    },
    {
        "user": "U35FGUMN0",
        "text": "<@U35FGUMN0|walker> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1481658214.000098"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U0KM61BCP> thanks for your advices, your write up above definitely are good practices for successful opensource. <@U0YQK8WSV> <@U1Y2R5C9L> another important aspect besides adopting these practices is that we should establish a timeline. as a start I’d like to propose that Java SDK be released along with the other related projects (fabric, node.js SDK) for v1.0, which I believe is slated for March 2017. this would guide the planning activities in JIRA. do you guys agree with this goal? a number of hyperledger adopters have asked for Java SDK for v1.0…",
        "edited": {
            "user": "U13TWBRBL",
            "ts": "1481659112.000000"
        },
        "ts": "1481659060.000099"
    },
    {
        "type": "message",
        "user": "U0YQK8WSV",
        "text": "March is a reasonable target ",
        "ts": "1481659148.000102"
    },
    {
        "type": "message",
        "user": "U0YQK8WSV",
        "text": "Makes sense to release the java sdk along with fabric and node sdk",
        "ts": "1481659218.000103",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U13TWBRBL",
                    "U1Y2R5C9L"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U2NDE1ZCK",
        "text": "Will there be Alpha or Beta 1.0 releases of the Java SDK?",
        "ts": "1481660246.000104"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U2NDE1ZCK> good question! <@U0YQK8WSV> for a quality release in March we really need to put out alpha in Jan. and beta in Feb. or something like that",
        "ts": "1481660601.000105"
    },
    {
        "user": "U1KDHJT6H",
        "text": "<@U1KDHJT6H|claytonsims> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1481661835.000106"
    },
    {
        "user": "U3DKYHK96",
        "text": "<@U3DKYHK96|ddlees> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1481662920.000107"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "<@U0KM61BCP> Agreed",
        "ts": "1481671533.000108"
    },
    {
        "type": "message",
        "user": "U2Q0HP4HY",
        "text": "Pardha commented in a gerrit commit that a constant should be configurable.  In Java I think the expectation is that should be in a properties file.  A class in the helper directory to manage it.  Any other thoughts ?",
        "ts": "1481678167.000109"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "<@U2Q0HP4HY> that depends how we want to manage the properties file. I think instead of a file, we can expect system properties which we can use, and in absence of these properties, just use the default ones",
        "ts": "1481683553.000110"
    },
    {
        "type": "message",
        "user": "U1Y2R5C9L",
        "text": "otherwise no point if user cannot modify them",
        "ts": "1481683572.000111"
    },
    {
        "type": "message",
        "user": "U13TWBRBL",
        "text": "<@U1Y2R5C9L> <@U0YQK8WSV> can you confirm your commitment to a roadmap for a Alpha in Jan, Beta in Feb. and official release in March? we really need this consented on and written down in order to guide our activities in the next 3 months",
        "ts": "1481690260.000112"
    }
]