[
    {
        "type": "message",
        "user": "U0X3PTHN0",
        "text": "<@U307KJEDU> hi might be worth talking to <@U196R0LA2> who has simplified deployment of HLF across any number of machines local and wide area",
        "ts": "1480856902.000010"
    },
    {
        "user": "U39MD9UC8",
        "text": "<@U39MD9UC8|name63> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1480876291.000013"
    },
    {
        "type": "message",
        "user": "U39MD9UC8",
        "text": "The chaincode is starting without any errors",
        "ts": "1480876760.000017"
    },
    {
        "user": "U3AFRMY68",
        "text": "<@U3AFRMY68|donjohnny> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1480888284.000020"
    },
    {
        "type": "message",
        "user": "U196R0LA2",
        "text": "<@U307KJEDU> i can definitely talk to you about the work i’ve done to streamline HLF deployment if you’re interested",
        "edited": {
            "user": "U196R0LA2",
            "ts": "1481215817.000000"
        },
        "ts": "1480905405.000023"
    },
    {
        "type": "message",
        "user": "U12AHQ3NK",
        "text": "The Query interface is been omitted in the current fabric code.  So now query functions will also be logged into the blockchain as  transactions?",
        "ts": "1480912645.000026"
    },
    {
        "type": "message",
        "user": "U0ULK2JPP",
        "text": "<@U12AHQ3NK> since (1) everything is a proposal from client to the peer (to the endorser to be more specific) and (2) proposals are not written to the ledger at the time of endorsement,  there is no need to make the distinction between a query and an invoke. The response returned by the proposal will contain the return value (that query used to return) from the chaincode. It is upto the application to determine what should be converted to a transaction to be committed to the ledger",
        "edited": {
            "user": "U0ULK2JPP",
            "ts": "1480914215.000000"
        },
        "ts": "1480914144.000027"
    },
    {
        "type": "message",
        "user": "U12AHQ3NK",
        "text": "oh.. so does that mean if i have just have simple query function in a CC and if i have to make it a transaction then i would have to use PutState() inside the query function? How to determine what should be converted to transaction? Is it from CC level or the SDK will a interface  for it?",
        "edited": {
            "user": "U12AHQ3NK",
            "ts": "1480915405.000000"
        },
        "ts": "1480915152.000031"
    }
]