[
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "<@U0P2GSA8Z> <@U0KM61BCP>:  I tried to be explicit in the table I added to the doc last week, if it is a help. For example, \"TSC attests to fully functional code base, documentation and suitability for usage as:\nDefined in formal documentation\nCharacterized across following dimensions:\nfunctional \ntechnical \n\"-ilities\"\noperational \/ service level agreement (SLA)\nAs verified by test coverage judged against formal documentation and commensurate with other mature projects\nAs verified by past and ongoing reviews\n\"",
        "ts": "1465826061.000005"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "<@U0P2GSA8Z> <@U0KM61BCP>: I am separately trying to consolidate a list of considerations that keep coming up in the discussions",
        "ts": "1465826148.000006"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U14KZA474>: thanks!",
        "ts": "1465830989.000007"
    },
    {
        "type": "message",
        "user": "U0P2GSA8Z",
        "text": "<@U0KM61BCP> could we discuss <@U14KZA474>'s table on this week's TSC call? this is introducing quite a bit of process that we don't have today and it'd be interesting to know what others think",
        "ts": "1465835484.000008"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "which table?",
        "ts": "1465835525.000009"
    },
    {
        "type": "message",
        "user": "U0P2GSA8Z",
        "text": "I'm wondering whether the restriction on what can be changed in a mature project isn't going too far",
        "ts": "1465835538.000010"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "why would we have restrictions?",
        "ts": "1465835554.000011"
    },
    {
        "type": "message",
        "user": "U0P2GSA8Z",
        "text": "in the exit criteria draft, jeremy added a table",
        "ts": "1465835555.000012"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "oh I’ll have to go look",
        "ts": "1465835565.000013"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "exit from incubation not a function of done-ness",
        "ts": "1465835579.000014"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "open source is never done",
        "ts": "1465835596.000015"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "My thought is not about doneness, but about what's blessed by the TSC using which criteria and when.",
        "ts": "1465836524.000016"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "E.g., if the TSC designates a project as mature, does that mean it follows a consistent change control process? E.g., that any designated release has been reviewed via the defined gerritt reviewers? I.e., it's followed a change control process and release process?",
        "ts": "1465836824.000017"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "E.g., how far can the design and implementation change or vary from what the TSC ok'ed before it has to go back to the proposal process?",
        "ts": "1465837023.000018"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "Or does the TSC give up all control and responsibility once a project is promoted to mature because the project itself is capable of handling it on its own?",
        "ts": "1465837079.000019"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "The reason to be explicit is that the discussions have made clear that some folks may misinterpret \"mature\" as an attestation. Following a release process is not just a DevOps thing. Often, people assume that a project following a release process has change controls, quality assurance and fit-for-purpose attestations being made.",
        "ts": "1465837276.000020"
    },
    {
        "type": "message",
        "user": "U14KZA474",
        "text": "I think this will be particularly important for Hyperledger, given the visibility and the potential for use with financial transactions. Therefore, I'd suggest making that distinction between project's maturity and what's being attested to and by whom front-and-center.",
        "ts": "1465837523.000021"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U14KZA474>: please weigh in on mailing list thread (hyperledger-tsc list) thanks... better to have this recorded\/archived for posterity",
        "ts": "1465845225.000022"
    }
]