[
    {
        "type": "message",
        "user": "U3U0MV3PZ",
        "text": "<@U0YJUECE8> what I am looking for is using blockchain to \"control and record\" accesses to off-chain data, e.g.\n\nApplication would query chaincode to access off-chain data, \nThe chaincode would get the \"access policies\" stored on chain and verify permissions\nRetrieve off-chain data\nRecord the access to the offchain data\nReturn the off-chain data to application",
        "ts": "1484920106.000011"
    },
    {
        "type": "message",
        "user": "U0YJUECE8",
        "text": "<@U3U0MV3PZ> hmm interesting use case, do you have to have the chaincode access the off-chain data directly or could you have a front-end app accessing the chaincode for access policies, getting a authn\/authz decision that way, and then the front-end app could access the off-chain data?   Also, is the off-chain data a read-only reference or would it be updated?  There is a lot to consider.   The fact that chaincode needs to be deterministic is a key consideration.  And if you have multiple organizations that don't necessarily trust each other (which is an essential characteristic of blockchain to begin with), is this off-chain data available to all parties?  \n\nThis is an area of interest to me, the integration of blockchain apps with other \"Systems of Record\", but I'm afraid I don't have any good answers for you, at this point, just more questions- trying to give you some \"food for thought\" and maybe stir some minds greater than mine to enter the discussion.  :slightly_smiling_face:",
        "ts": "1484921546.000012"
    },
    {
        "type": "message",
        "user": "U3U0MV3PZ",
        "text": "<@U0YJUECE8> having the front-end app accessing the chaincode to control and access policies is insecure since if the application is hacked, there would be no control and record at all. and this would happen even if there is one app hacked.",
        "ts": "1484922532.000015"
    },
    {
        "type": "message",
        "user": "U3U0MV3PZ",
        "text": "the availability of the off-chain data is based on \"contracts\" between the parties",
        "ts": "1484922613.000016"
    },
    {
        "type": "message",
        "user": "U0YJUECE8",
        "text": "<@U3U0MV3PZ> ok, well, like I said, I'm afraid I'm not equipped at this time to give you a good answer, hopefully others might weigh in to help.  Good luck!",
        "ts": "1484922857.000017"
    },
    {
        "type": "message",
        "user": "U3U0MV3PZ",
        "text": "<@U0YJUECE8> thx :slightly_smiling_face:",
        "ts": "1484923741.000018"
    }
]