[
    {
        "type": "message",
        "user": "U159NP4MQ",
        "text": "Hi, do we have sawtooth explorer ?",
        "ts": "1472975097.000004"
    },
    {
        "type": "message",
        "user": "U1CN8CVCK",
        "text": "hi what is the best way to create dynamic membership by hyperledger ? Personally I like tendermint like round robin type algorithm for developing not-so-fast-tps app",
        "edited": {
            "user": "U1CN8CVCK",
            "ts": "1472997235.000000"
        },
        "ts": "1472993135.000005"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "<@U159NP4MQ> Yes, we have.  there are many explorers in sawtooth channel. you can join it and have a discussion with them.",
        "ts": "1473046156.000007"
    },
    {
        "type": "message",
        "user": "U1ZUSJHAA",
        "text": "<@U159NP4MQ> as <@U0N3AJSSU> said, \"we do have a JS framework to view the blockchain and issue transactions for marketplac we haven't yet submitted it into open source but may be able to provide it in advance if you need it\".",
        "ts": "1473046613.000008"
    },
    {
        "type": "message",
        "user": "U159NP4MQ",
        "text": "<@U1ZUSJHAA> Thank in advance :slightly_smiling_face:",
        "ts": "1473046667.000009"
    },
    {
        "type": "message",
        "user": "U1T95QCUE",
        "text": "I have questions about a smart contract. As we know, the definition of a smart contract is the contract that will execute itself when it meets the defined condition.\n\nQuestions,\nplease correcting my understanding of Hyperledger\/Fabric:\n1. In the Hyperledger\/Fabric, smart contract is the deploying chaincode.\n2. The chaincode will be executed only when we deploy\/invoke on it.\n3. The chaincode is *not* a persistent process that can be run forever on it own.\n4. The chaincode is stateless, and impossible to store any temporary value on it.\n5. Making a smart contract on the Hyperledger\/Fabric means to invoke the function on our customized chaincode by the external caller. e.g. calling the function through REST API, SDK, etc.\n\nSo, if my understanding is correct, is the chaincode smart?",
        "edited": {
            "user": "U1T95QCUE",
            "ts": "1473058262.000000"
        },
        "ts": "1473058247.000010"
    }
]