[
    {
        "user": "U0PLF6BGQ",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PLF6BGQ|turnshek> has joined the channel",
        "ts": "1456824844.000441"
    },
    {
        "user": "U0PLH13SS",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PLH13SS|cphrmky> has joined the channel",
        "ts": "1456825144.000442"
    },
    {
        "user": "U0PM22F6E",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PM22F6E|dweill> has joined the channel",
        "ts": "1456835868.000443"
    },
    {
        "type": "message",
        "user": "U0MUQGQUW",
        "text": "<@U0NQY299A>: we work with Imogen Heap on the publishing side, really cool stuff you guys are doing",
        "ts": "1456839056.000444"
    },
    {
        "type": "message",
        "user": "U0MUQGQUW",
        "text": "<https:\/\/www.dmpgroup.com\/2015\/12\/imogen-heap-x-downtown\/>",
        "attachments": [
            {
                "service_name": "Downtown Music Publishing",
                "title": "Imogen Heap x Downtown",
                "title_link": "https:\/\/www.dmpgroup.com\/2015\/12\/imogen-heap-x-downtown\/",
                "text": "We are delighted to announce that Imogen Heap has joined our team. The non-exclusive worldwide deal covers Heap's portion of Taylor Swift's 1989 finale \"Clean,\" plus five songs from Heap's 2014 album, Sparks: \"The Beast,\" \"Entanglement,\" \"Climb to",
                "fallback": "Downtown Music Publishing: Imogen Heap x Downtown",
                "image_url": "https:\/\/www.dmpgroup.com\/wp-content\/uploads\/2015\/12\/imogen-heap-650-430.jpg",
                "ts": 1450378776,
                "from_url": "https:\/\/www.dmpgroup.com\/2015\/12\/imogen-heap-x-downtown\/",
                "image_width": 378,
                "image_height": 250,
                "image_bytes": 84627,
                "id": 1
            }
        ],
        "ts": "1456839076.000445"
    },
    {
        "type": "message",
        "user": "U0KM61BCP",
        "text": "<@U0N309X5X>: the Hyperledger project is at its core an open source initiative… we hope that the fabric we deliver will become the de facto cross-industry standard. However, if by standard, you mean that we should be writing a specification, rather than delivering code, then I’d suggest that’s a very different mission than most members understood when they joined",
        "ts": "1456840810.000447"
    },
    {
        "type": "message",
        "user": "U0NLZCF8V",
        "text": "<@U0N309X5X>: I don't understand the idea of starting from scratch either... why reinvent the wheel. Shall the project create everything new? Should we not ask the current experts for the advice? You have the risk of of becoming (as mentioned before) just another blockchain that nobody will use.",
        "ts": "1456841130.000448"
    },
    {
        "type": "message",
        "user": "U0MV406EB",
        "text": "<@U0NQY299A>: Love the smart contract side of what they did with Imogen but it doesn’t address the wider issue around copyright information(who wrote what and who currently represents whom) delivery and dispute managment which is a huge issue. We deal with 100’s if not 1000’s of databases that slide from truth and are perpetually out of date.",
        "ts": "1456845805.000449"
    },
    {
        "type": "message",
        "user": "U0MV406EB",
        "text": "Devs and the industry have been approaching this from the artist side which is an incremental move, not a  step change. Needs to be approached from composition side - can’t license music(i.e. Make a new Spotify) more efficiently without that information.",
        "edited": {
            "user": "U0MV406EB",
            "ts": "1456845890.000000"
        },
        "ts": "1456845873.000450"
    },
    {
        "type": "message",
        "user": "U0NQY299A",
        "text": "<@U0MV406EB>: Definitely agree with the fact that there is more work to be done. We (ConsenSys) wanted to work with Imogen and deploy Ujo to get the conversation going around the power of smart contracts and educate the broader industry about how this technology can influence rights management and things like payments splits",
        "ts": "1456846260.000452"
    },
    {
        "type": "message",
        "user": "U0NQY299A",
        "text": "WRT to Hyperledger, I wanted to bring up the smart contracts we did for Ujo - so far what I've seen from these discussions is that Smart Contracts aren't a first class citizen",
        "ts": "1456846359.000453"
    },
    {
        "type": "message",
        "user": "U0NQY299A",
        "text": "I want to make the case that they should be",
        "ts": "1456846365.000454"
    },
    {
        "type": "message",
        "user": "U0MUQGQUW",
        "text": "In what way? The OBC documentation I’ve looked at puts chaincode (contracts) as central to creating a transaction",
        "ts": "1456846650.000455"
    },
    {
        "type": "message",
        "user": "U0NQY299A",
        "text": "Blockchain native contracts vs containerized services",
        "ts": "1456847727.000456"
    },
    {
        "type": "message",
        "user": "U0MUQGQUW",
        "text": "ah hah",
        "ts": "1456847740.000457"
    },
    {
        "type": "message",
        "user": "U0N81PGKV",
        "text": "<@U0MV406EB> That’s where we come in.  eVue Digital Labs has been working with the RIAA since 2014 to design a system that doesn’t disrupt the music industry, but applies the technology to the existing production and supply chains to provide a solution suitable for all stakeholders and in full compliance with US copyright law.",
        "ts": "1456849329.000458"
    },
    {
        "type": "message",
        "user": "U0MV406EB",
        "text": "The RIAA does not understand compositions",
        "ts": "1456849369.000459"
    },
    {
        "type": "message",
        "user": "U0N81PGKV",
        "text": "They do understand the pains of copyright enforcement and the loss of revenues due to piracy.",
        "ts": "1456849403.000460"
    },
    {
        "type": "message",
        "user": "U0MV406EB",
        "text": "From the recording side",
        "ts": "1456849430.000461"
    },
    {
        "type": "message",
        "user": "U0N81PGKV",
        "text": "The goal of the project is primarily to reduce contentious litigation for application platforms that serve digital content.",
        "ts": "1456849434.000462"
    },
    {
        "type": "message",
        "user": "U0MV406EB",
        "text": "there is a huge schism between labels(recordings) and publishers(compositions). Let’s take this into DM",
        "ts": "1456849461.000463"
    },
    {
        "type": "message",
        "user": "U0N81PGKV",
        "text": "Royalty splits are essentially low hanging fruit.",
        "ts": "1456849463.000464"
    },
    {
        "type": "message",
        "user": "U0N81PGKV",
        "text": "Agreed",
        "ts": "1456849472.000465"
    },
    {
        "type": "message",
        "user": "U0N309X5X",
        "text": "<@U0KM61BCP> , <@U0NLZCF8V> yes I did mean the project owning a specification. I know this project will deliver a great platform certainly because of the experts we have. I just believe that unifying around a specification as well will help other implementations have a bona fide checklist of compliance so that we can have a one worldwide platform from many implementations.\n\nAs for the reinvention, it was still to drive the standard specification, but being that the arguments for a production-level implementation is very sound because we have great experts, I'm fine with that approach too (having expressed my point :))\n\nIn brief I look forward participating however the community goes code-wise. I also hope you'll consider owning a standard specification as well.\n\nTo digress a bit, perhaps there might be regulations or other controls in some key economy elsewhere in the world which may make the production-level subject to modification or rewrite to be viable there (cryptographic export\/import regulations, anonymity, trade policies, \"censorship\", etc) that's one of the reasons owning the standard could possibly keep the initiative under the same wing)...\n\nThanks for your feedback. I hope there's still more to add :)",
        "ts": "1456849490.000466"
    },
    {
        "user": "U0PPNS91S",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PPNS91S|dana_ingraham> has joined the channel",
        "ts": "1456866450.000467"
    },
    {
        "user": "U0PR5TY1Y",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PR5TY1Y|yuhumai> has joined the channel",
        "ts": "1456886966.000468"
    },
    {
        "user": "U0PRM7DHN",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0PRM7DHN|rob5> has joined the channel",
        "ts": "1456899931.000469"
    }
]