[
    {
        "type": "message",
        "user": "U184J2R7S",
        "text": "<@U3BD4SWBH> a few people are looking to create a docker image to help people get the version 1 work up and running easier.  this will get checked in and will get taken to the hackfest for Hyperledger next week.  A couple of people are also working on some documentation to help people on how to program chaincode and how the multi-channel aspect works on the 10 design.",
        "ts": "1485599942.004174"
    },
    {
        "type": "message",
        "user": "U184J2R7S",
        "text": "<@U11HTMW0H> can you let everyone know on general channel and fabric-dev channel where the CI will push the docker images for version 1 please when done?  Thanks!",
        "ts": "1485599996.004175"
    },
    {
        "type": "message",
        "user": "U3NKB7W2Y",
        "text": "Negotiating with the Bitfinex hacker <http:\/\/pastebin.com\/6SCNuS5T>",
        "attachments": [
            {
                "service_name": "Pastebin",
                "title": "Open Letter to the Bitfinex Hacker - Pastebin.com",
                "title_link": "http:\/\/pastebin.com\/6SCNuS5T",
                "fallback": "Pastebin: Open Letter to the Bitfinex Hacker - Pastebin.com",
                "image_url": "http:\/\/pastebin.com\/i\/facebook.png",
                "from_url": "http:\/\/pastebin.com\/6SCNuS5T",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 19206,
                "service_icon": "http:\/\/pastebin.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1485602013.004176"
    },
    {
        "user": "U3X39L4DN",
        "text": "<@U3X39L4DN|pjheeta> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485609698.004178"
    },
    {
        "type": "message",
        "user": "U3BD4SWBH",
        "text": "<@U184J2R7S> thanks",
        "ts": "1485617461.004181"
    },
    {
        "user": "U3YG0JR55",
        "text": "<@U3YG0JR55|narenkrishnan> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485627404.004182"
    },
    {
        "type": "message",
        "user": "U3YG0JR55",
        "text": "<@U1P1ZV6RF>  I am looking for the developer preview of 1.0. Let me know if you get it .. thanks",
        "ts": "1485627731.004183"
    },
    {
        "user": "U3YG1U5FH",
        "text": "<@U3YG1U5FH|skgupta29> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485627953.004184"
    },
    {
        "user": "U3XTWA892",
        "text": "<@U3XTWA892|zol> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485634812.004188"
    },
    {
        "type": "message",
        "user": "U3XTWA892",
        "text": "I tried to start a (test) cello stack on an Amazon AWS.  Everything seems to be running. How can I get into the dashboard?",
        "ts": "1485634949.004189"
    },
    {
        "type": "message",
        "user": "U2NCMCKKP",
        "text": "<@U31A496G2> thank you for you response.. I ended up moving the whole permission\/acl logic inside the GO chaincodes.. it's orrible yeah, because my chaincodes are full of loops and put\/get state which really slow down tx execution, but it works fine for a mock",
        "ts": "1485636910.004190"
    },
    {
        "type": "message",
        "user": "U11MANG9G",
        "text": "------------------------------------------------------------\n\nDear <@U3NKB7W2Y> \/ (*1 1*),\n\nI don’t want to come across as too direct, so don’t take what I’m about to write in a bad\/negative way. On the contrary:\n\nWhile there is so much going on in the blockchain space these days - most of the prominent figures on these channels are well aware of these. We don’t (really) live under a rock :wink:\n\nAt the same time - we are *really making an extra effort to not get involved in\/with these flaming wars* and neither try not to side with parties nor pick and choose the correct “camp” - while I can speak (\/write?) only for myself, I have seen this consistently with many others members around me, regardless of employer, association or “bitcoin\/blockchain” camp.\n\nNoting that more than just that we do not have a “crypto-coin\/crypto-currency”, more importantly, we all (or the vast majority of those involved or even part of it as observers, at least as far as I can see\/tell) are trying to keep this fertile ground for collaboration, that is also friendly and yes - *a nice place where our time is well spent*. We share ideas, discuss or even argue (technically) about directions, possibilities, technical decisions and plans. BUT, again, we really try to avoid the exact items that you have been posting here.\n\nWhile I would not call these posts “outright” spam - I do not believe that they belong here, nor do I feel that they really contribute to the “goal” of this project\/effort. So in the context of Open Letters, I\/many of us would appreciate it if you don’t post such things here - especially not in the <#C0J02NU1E|general> channel. If you really feel that you “need to post\/vent” :wink:, at best, I would suggest the <#C0HVD269Z|random> channel, or so. I, personally, do check it out, randomly :wink:.\n\nFinally (and also because most of your posts are about “bad people”, etc…), please appreciate that instead of blocking you, you getting another user, etc. - my simple request to you is:  *Please help us keep Hyperledger Project’s Slack - open, friendly and productive*.\n\nI really hope you would appreciate where this is coming from &amp; and that you enjoy the rest of the weekend…\n\nAmiably,\n— Jonathan\n\n------------------------------------------------------------",
        "ts": "1485642317.004193",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U3EGXRAJG",
                    "U0N4P17ND",
                    "U3QM6RWS2",
                    "U0N4D2T61",
                    "U0YK3KKCY",
                    "U36HLH8SC",
                    "U2NCMCKKP"
                ],
                "count": 7
            }
        ]
    },
    {
        "user": "U3YH12MGX",
        "text": "<@U3YH12MGX|ppajarcu> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485643686.004194"
    },
    {
        "user": "U3X6EA6JC",
        "text": "<@U3X6EA6JC|kbombach> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1485667959.004197"
    }
]